---
kind: property
id: P:Autodesk.Revit.DB.Visual.Checker.TextureOffsetLock
source: html/a0055637-78a6-be0c-c9f0-b44dcd39cef5.htm
---
# Autodesk.Revit.DB.Visual.Checker.TextureOffsetLock Property

The property labeled "Offset Lock" from the "Checker" schema.

## Syntax (C#)
```csharp
public static string TextureOffsetLock { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".